{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip",
      "version": "'642b0c5'"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer",
      "version": "'b74fab3'"
    },
    "cmp-cmdline": {
      "src": "https://github.com/hrsh7th/cmp-cmdline",
      "version": "'d126061'"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp",
      "version": "'cbc7b02'"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path",
      "version": "'c642487'"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip",
      "version": "'98d9cb5'"
    },
    "kanagawa.nvim": {
      "src": "https://github.com/rebelot/kanagawa.nvim",
      "version": "'aef7f5c'"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp",
      "version": "'a1d5048'"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "'9ccd58a'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'4916d65'"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim",
      "version": "'0fcc838'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'b9fd522'"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'cfb85dc'"
    },
    "vim-wordmotion": {
      "src": "https://github.com/chaoren/vim-wordmotion",
      "version": "'81d9bd2'"
    }
  }
}
